In [248]:
! pip  install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\201077405\appdata\roaming\python\python312\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\201077405\appdata\roaming\python\python312\site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\201077405\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\201077405\appdata\roaming\python\python312\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\201077405\appdata\roaming\python\python312\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\201077405\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

https://pandas.pydata.org/docs/getting_started/intro_tutorials/01_table_oriented.html#min-tut-01-tableoriented

In [331]:
import numpy as np

import pandas as pd
df = pd.DataFrame(
    {
        "NOME": [ "Braund, MR. Owen Harris",
                  "Allen,Mr. William Henry",
                  "Bonnell, Miss. Elizabeth"],
        "IDADE": [22, 35, 58],
        "SEXO": ["male", "male", "female"],

    }
     
)

In [332]:
df

                       NOME  IDADE    SEXO
0   Braund, MR. Owen Harris     22    male
1   Allen,Mr. William Henry     35    male
2  Bonnell, Miss. Elizabeth     58  female

In [291]:
# Cmd para renomear colunas 

df_renamed = df.rename(
    columns={
        "NOME": "new_name",
      "IDADE": "new_idade",
       "SEXO": "new_sexo",
 }
 )

In [294]:
df_renamed

                   new_name  new_idade new_sexo
0   Braund, MR. Owen Harris         22     male
1   Allen,Mr. William Henry         35     male
2  Bonnell, Miss. Elizabeth         58   female

In [ ]:
# Cmd para diminuir fote da coluna
df_renamed = df.rename(
    columns=str.lower
 )

In [302]:
df_renamed

                       nome  idade    sexo
0   Braund, MR. Owen Harris     22    male
1   Allen,Mr. William Henry     35    male
2  Bonnell, Miss. Elizabeth     58  female

In [304]:
df

                       NOME  IDADE    SEXO
0   Braund, MR. Owen Harris     22    male
1   Allen,Mr. William Henry     35    male
2  Bonnell, Miss. Elizabeth     58  female

In [206]:
df["nova_coluna"] = (df["Idade"]*np.random.randn(3))
df

# Cmd para adicionar colunas e fazer uma soma

                       Name  Idade    Sexo  nova_coluna
0   Braund, MR. Owen Harris     22    male    20.888904
1   Allen,Mr. William Henry     35    male     7.147933
2  Bonnell, Miss. Elizabeth     58  female    45.762338

In [209]:
df[["Idade","Sexo"]]

   Idade    Sexo
0     22    male
1     35    male
2     58  female

In [98]:
df["Idade"]>35

0    False
1    False
2     True
Name: Idade, dtype: bool

In [87]:
df["Idade"].max()

np.int64(58)

In [12]:
df.describe()

           Idade
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [20]:
import numpy as np

import pandas as pd

In [135]:
# s = pd.Series(data, index=index)
s = pd.Series(np.random.randn(6), index=["a", "b", "c", "d", "e", "f"])
print(s)

a   -0.748322
b    1.593073
c    0.405891
d   -0.447898
e    0.045695
f   -1.046633
dtype: float64

In [137]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [43]:
d= {"b":1, "c":2,"d":4}

type(d)

pd.Series(d)

b    1
c    2
d    4
dtype: int64

In [44]:

pd.Series(d, index=["i", "c", "d", "a"])

i    NaN
c    2.0
d    4.0
a    NaN
dtype: float64

In [45]:
pd.Series(5.0, index=["a", "b", "c", "d", "e","f"])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
f    5.0
dtype: float64

In [64]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

df

                   A         B         C         D
2013-01-01  1.249218  0.428718  0.439038  0.618253
2013-01-02 -0.440660 -1.756244 -0.498135  0.515715
2013-01-03 -0.942340 -0.858337 -1.559017 -0.893343
2013-01-04 -1.495408 -1.094747 -0.295658 -0.512687
2013-01-05 -0.586967  1.072169  1.340880 -0.410721
2013-01-06 -0.093715 -0.131954  0.152485 -0.434753

In [66]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
       "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
         "F": "foo",
     }
)

In [68]:
print(df2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [70]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [18]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [ ]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
                  index=['cobra', 'viper', 'sidewinder'],
                columns=['max_speed', 'shield'])
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [33]:
df.loc['sidewinder']

max_speed    7
shield       8
Name: sidewinder, dtype: int64

In [34]:
df.loc[['viper','sidewinder']]

            max_speed  shield
viper               4       5
sidewinder          7       8

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html#pandas.DataFrame.loc

In [347]:
import pandas as pd

data = [[50, True], [40, False], [30, False]]

df02 = pd.DataFrame(data)

In [348]:
data

[[50, True], [40, False], [30, False]]

In [364]:

print(df.iloc[1, 1])

35

In [336]:
df

                       NOME  IDADE    SEXO
0   Braund, MR. Owen Harris     22    male
1   Allen,Mr. William Henry     35    male
2  Bonnell, Miss. Elizabeth     58  female

In [366]:
df.iloc[1, 1]

np.int64(35)

In [ ]:
df.iloc[[0, 2]]

Especifique colunas incluindo seus índices em outra lista:

df.iloc[[0, 2], [0, 1]]

Você também pode especificar uma fatia do DataFrame com índices from e to, separados por dois-pontos:

df.iloc[0:2]

In [382]:
df

                       NOME  IDADE    SEXO
0   Braund, MR. Owen Harris     22    male
1   Allen,Mr. William Henry     35    male
2  Bonnell, Miss. Elizabeth     58  female

In [370]:
df.iloc[2, 1]

np.int64(58)

In [379]:
df.iloc[[0, 1]]

                      NOME  IDADE  SEXO
0  Braund, MR. Owen Harris     22  male
1  Allen,Mr. William Henry     35  male

In [397]:
df.iloc[[0, 2], [0, 2]]

                       NOME    SEXO
0   Braund, MR. Owen Harris    male
2  Bonnell, Miss. Elizabeth  female

In [399]:
df.iloc[0:3]

                       NOME  IDADE    SEXO
0   Braund, MR. Owen Harris     22    male
1   Allen,Mr. William Henry     35    male
2  Bonnell, Miss. Elizabeth     58  female

In [ ]:
# https://pandas.pydata.org/docs/getting_started/intro_tutorials/08_combine_dataframes.html

In [ ]:
for i in range(10):
    print(i)

In [ ]:
from pkg_resources import null_ns_handler


num = 1 
while num < 10:
    print(num)
    num = num + 1

In [ ]:
resposta = ''

while resposta != 'sim':
    resposta = input('Já acabou ?')